#### 📖 Terraform Plan (infra/resources/prod) - success
<details>
<summary>Terraform Plan</summary>

```hcl
  # module.cdn_fe.azurerm_cdn_frontdoor_rule.rewrite_index will be created
  + resource "azurerm_cdn_frontdoor_rule" "rewrite_index" {
      + behavior_on_match           = "Continue"
      + cdn_frontdoor_rule_set_id   = (known after apply)
      + cdn_frontdoor_rule_set_name = (known after apply)
      + id                          = (known after apply)
      + name                        = "RewriteIndex"
      + order                       = 1

      + actions {
          + url_rewrite_action {
              + destination             = "/index.html"
              + preserve_unmatched_path = false
              + source_pattern          = "/"
            }
        }

      + conditions {
          + request_uri_condition {
              + negate_condition = false
              + operator         = "Any"
            }
        }
    }

  # module.backend_func.module.cdc_backend_func.azurerm_linux_function_app.this will be updated in-place
  ~ resource "azurerm_linux_function_app" "this" {
      ~ app_settings                                   = {
          + "FIMS_BASE_URL"                                                                                    = (sensitive value)
          - "FIMS_REDIRECT_URL"                                                                                = "https://api-app.io.pagopa.it/api/cdc/v1/fcb" -> null
            # (45 unchanged elements hidden)
        }
        id                                             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-cdc-rg-01/providers/Microsoft.Web/sites/io-p-itn-cdc-backend-func-01"
        name                                           = "io-p-itn-cdc-backend-func-01"
        tags                                           = {
            "BusinessUnit"                                   = "CDC"
            "CostCenter"                                     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"                                      = "Terraform"
            "Environment"                                    = "Prod"
            "ManagementTeam"                                 = "IO CDC"
            "Owner"                                          = "IO"
            "Source"                                         = "https://github.com/pagopa/io-cdc/blob/main/infra/resources/prod"
            "hidden-link: /app-insights-conn-string"         = "InstrumentationKey=ab45103a-cb4f-474b-933f-d802ed1082d5;IngestionEndpoint=https://westeurope-3.in.applicationinsights.azure.com/;LiveEndpoint=https://westeurope.livediagnostics.monitor.azure.com/;ApplicationId=2a5ffa17-99f9-4d9b-a253-18dba6759d94"
            "hidden-link: /app-insights-instrumentation-key" = "ab45103a-cb4f-474b-933f-d802ed1082d5"
            "hidden-link: /app-insights-resource-id"         = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/microsoft.insights/components/io-p-ai-common"
        }
        # (33 unchanged attributes hidden)

      ~ sticky_settings {
          ~ app_setting_names       = [
              - "APPINSIGHTS_SAMPLING_PERCENTAGE",
              - "AzureFunctionsJobHost__logging__applicationInsights__samplingSettings__initialSamplingPercentage",
              - "AzureFunctionsJobHost__logging__applicationInsights__samplingSettings__maxSamplingPercentage",
              - "AzureFunctionsJobHost__logging__applicationInsights__samplingSettings__minSamplingPercentage",
                "SLOT_TASK_HUBNAME",
              - "AzureFunctionsWebHost__hostid",
                "AzureFunctionsJobHost__extensions__durableTask__hubName",
              + "APPINSIGHTS_SAMPLING_PERCENTAGE",
              + "AzureFunctionsWebHost__hostid",
              + "AzureFunctionsJobHost__logging__applicationInsights__samplingSettings__minSamplingPercentage",
              + "AzureFunctionsJobHost__logging__applicationInsights__samplingSettings__maxSamplingPercentage",
              + "AzureFunctionsJobHost__logging__applicationInsights__samplingSettings__initialSamplingPercentage",
            ]
            # (1 unchanged attribute hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.backend_func.module.cdc_backend_func.azurerm_linux_function_app_slot.this[0] will be updated in-place
  ~ resource "azurerm_linux_function_app_slot" "this" {
      ~ app_settings                                   = {
          + "FIMS_BASE_URL"                                                                                    = (sensitive value)
          ~ "FIMS_CLIENT_ID"                                                                                   = (sensitive value)
          ~ "FIMS_CLIENT_SECRET"                                                                               = (sensitive value)
          ~ "FIMS_ISSUER_URL"                                                                                  = (sensitive value)
          - "FIMS_REDIRECT_URL"                                                                                = "https://api-app.io.pagopa.it/api/cdc/v1/fcb" -> null
          ~ "FIMS_SCOPE"                                                                                       = (sensitive value)
            # (42 unchanged elements hidden)
        }
        id                                             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-cdc-rg-01/providers/Microsoft.Web/sites/io-p-itn-cdc-backend-func-01/slots/staging"
        name                                           = "staging"
        tags                                           = {
            "BusinessUnit"                                   = "CDC"
            "CostCenter"                                     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"                                      = "Terraform"
            "Environment"                                    = "Prod"
            "ManagementTeam"                                 = "IO CDC"
            "Owner"                                          = "IO"
            "Source"                                         = "https://github.com/pagopa/io-cdc/blob/main/infra/resources/prod"
            "hidden-link: /app-insights-conn-string"         = "InstrumentationKey=ab45103a-cb4f-474b-933f-d802ed1082d5;IngestionEndpoint=https://westeurope-3.in.applicationinsights.azure.com/;LiveEndpoint=https://westeurope.livediagnostics.monitor.azure.com/;ApplicationId=2a5ffa17-99f9-4d9b-a253-18dba6759d94"
            "hidden-link: /app-insights-instrumentation-key" = "ab45103a-cb4f-474b-933f-d802ed1082d5"
            "hidden-link: /app-insights-resource-id"         = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/microsoft.insights/components/io-p-ai-common"
        }
        # (31 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.cdn_fe.module.cdc_fe_cdn.azurerm_cdn_frontdoor_endpoint.this will be updated in-place
  ~ resource "azurerm_cdn_frontdoor_endpoint" "this" {
        id                       = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-cdc-rg-01/providers/Microsoft.Cdn/profiles/io-p-itn-cdc-fe-afd-01/afdEndpoints/io-p-itn-cdc-fe-fde-01"
        name                     = "io-p-itn-cdc-fe-fde-01"
      ~ tags                     = {
            "BusinessUnit"   = "CDC"
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO CDC"
          + "ModuleName"     = "azure_cdn"
          + "ModuleSource"   = "DX"
          + "ModuleVersion"  = "0.2.0"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-cdc/blob/main/infra/resources/prod"
        }
        # (3 unchanged attributes hidden)
    }

  # module.cdn_fe.module.cdc_fe_cdn.azurerm_cdn_frontdoor_profile.this will be updated in-place
  ~ resource "azurerm_cdn_frontdoor_profile" "this" {
        id                       = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-cdc-rg-01/providers/Microsoft.Cdn/profiles/io-p-itn-cdc-fe-afd-01"
        name                     = "io-p-itn-cdc-fe-afd-01"
      ~ tags                     = {
            "BusinessUnit"   = "CDC"
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO CDC"
          + "ModuleName"     = "azure_cdn"
          + "ModuleSource"   = "DX"
          + "ModuleVersion"  = "0.2.0"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-cdc/blob/main/infra/resources/prod"
        }
        # (4 unchanged attributes hidden)

      + identity {
          + type = "SystemAssigned"
        }
    }

  # module.cdn_fe.module.cdc_fe_cdn.azurerm_cdn_frontdoor_route.this will be updated in-place
  ~ resource "azurerm_cdn_frontdoor_route" "this" {
      ~ cdn_frontdoor_rule_set_ids      = [] -> (known after apply)
        id                              = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-cdc-rg-01/providers/Microsoft.Cdn/profiles/io-p-itn-cdc-fe-afd-01/afdEndpoints/io-p-itn-cdc-fe-fde-01/routes/io-p-itn-cdc-fe-cdnr-01"
        name                            = "io-p-itn-cdc-fe-cdnr-01"
        # (11 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.cdn_fe.module.cdc_fe_cdn.azurerm_cdn_frontdoor_rule_set.this will be created
  + resource "azurerm_cdn_frontdoor_rule_set" "this" {
      + cdn_frontdoor_profile_id = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-cdc-rg-01/providers/Microsoft.Cdn/profiles/io-p-itn-cdc-fe-afd-01"
      + id                       = (known after apply)
      + name                     = "ruleset"
    }

  # module.cdn_fe.module.cdc_fe_cdn.azurerm_dns_a_record.this["cdc.io.pagopa.it"] will be updated in-place
  ~ resource "azurerm_dns_a_record" "this" {
        id                  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-external/providers/Microsoft.Network/dnsZones/io.pagopa.it/A/cdc"
        name                = "cdc"
      ~ tags                = {
            "BusinessUnit"   = "CDC"
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO CDC"
          + "ModuleName"     = "azure_cdn"
          + "ModuleSource"   = "DX"
          + "ModuleVersion"  = "0.2.0"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-cdc/blob/main/infra/resources/prod"
        }
        # (6 unchanged attributes hidden)
    }

  # module.cdn_fe.module.cdc_fe_cdn.azurerm_dns_txt_record.validation["cdc.io.pagopa.it"] will be updated in-place
  ~ resource "azurerm_dns_txt_record" "validation" {
        id                  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-external/providers/Microsoft.Network/dnsZones/io.pagopa.it/TXT/_dnsauth.cdc"
        name                = "_dnsauth.cdc"
      ~ tags                = {
            "BusinessUnit"   = "CDC"
          + "Cdn"            = "io-p-itn-cdc-fe-afd-01"
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO CDC"
          + "ModuleName"     = "azure_cdn"
          + "ModuleSource"   = "DX"
          + "ModuleVersion"  = "0.2.0"
          + "Origin"         = "cdc.io.pagopa.it"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-cdc/blob/main/infra/resources/prod"
          - "cdn"            = "io-p-itn-cdc-fe-afd-01" -> null
          - "origin"         = "cdc.io.pagopa.it" -> null
        }
        # (4 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

Plan: 2 to add, 7 to change, 0 to destroy.

```

</details>
